{"title": "Double Room Clapham Junction", "price": "£750", "body": "\n\nQR Code Link to This Post\n\n\nAnd we are looking for a person who enjoys their own space but wants to be near social and transport hubs, to fill a cosy room in this flat. This newly renovated flat is in a perfect location. It is very well connected by public transport and close to many pubs and restaurants. Both Battersea park and Clapham Junction station are at walking distance (10 mins). You can also bike to South Kensington in 15-20mins. There are also multiple 24hr buses.\nThe bedroom (on the 1st floor) has a nice view of a private quiet residents garden. The flat has a large lounge with a balcony with seating, overlooking a quiet front garden. The lounge has a large corner sofa and a dining area. The kitchen is full equipped and it has an electric hob, washing machine, dishwasher and microwave. The flat has good security; the apartment is accessed from a main security door before the flat door, with electronic buzzer (only 5 flats in our block). The neighbourhood is also very safe and family friendly. There are bicycle racks (out of street view) on the 4th floor where you can safely leave your bike. There is also off-street private residents parking available.\nAbout us: We are a consultant (Warren, British) and a Manager (Natalie, British) who are both pretty chilled, interested in travel and reading. \nWe are always up for, having a chat with some beer/wine/coffee. If you would like to live with sociable people so we can all survive these shitty times with a gin tonic and a movie (we have Netflix), get in touch. Flat is available for viewings everyday in the evening (Skype or face-to-face). Moving in date ASAP, but we are quite flexible :D. \nThe flat has super fast fiber broadband 300MBits/s. \nFlat is available for viewings everyday, any time\nContact to discuss\n2 rooms are available, so you are able to choose. Flat is in a super quiet road (Dead End) and 2mins to a convenient bus stop (Bullen Street) and 8mins walk to Clapham Junction.\nRed Curtains Room (£750 pcm) Bills Incl\nDouble room with bed, office chair, 1 walk-in-wardrobe and a huge storage cupboard and a chest of drawers. The room is warm, bright and gets a lot of sunlight. \nPurple Curtains Room (£750 pcm) Bills Incl\nDouble room with bed, shelves storage and a large cupboard. Room is warm bright, quiet and gets a lot of sunlight.    ", "post_id": "7258555962", "created_time": "2021-01-07T21:56:05+0000", "modified_time": null}